Revit 2027 API
RebarShape.SimpleArc Property
 Check whether this shape consists of a single arc, possibly with hooks.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SimpleArc { get; }
Public ReadOnly Property SimpleArc As Boolean
	Get
public:
property bool SimpleArc {
	bool get ();
}
member SimpleArc : bool with get
Property Value
Boolean
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace